Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
nfig      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby_external[0].kubernetes_manifest.request_transformer_auth_header_replace_url[0] will be created
+ resource "kubernetes_manifest" "request_transformer_auth_header_replace_url" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + "Authorization: false",
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Authorization: false",
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby_external[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby_private_0[0].kubernetes_ingress_v1.ingress_kong will be created
+ resource "kubernetes_ingress_v1" "ingress_kong" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "archive.wallaby.node.glif.io"

              + http {
                  + path {
                      + path      = "/lotus/(.*)"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "wallaby-archive-private-0-lotus-service"

                              + port {
                                  + number = 1234
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.ingress-kong_wallaby_private_0[0].kubernetes_manifest.cors[0] will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby_private_0[0].kubernetes_manifest.request_transformer_auth_header_replace_url[0] will be created
+ resource "kubernetes_manifest" "request_transformer_auth_header_replace_url" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + "Authorization: false",
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = (known after apply)
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Authorization: false",
                    ]
                }
              + replace = {
                  + uri = "/$(uri_captures[1])"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = (known after apply)
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.ingress-kong_wallaby_private_0[0].random_string.rand will be created
+ resource "random_string" "rand" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-api[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-alternative-domain-wallaby-docs-subresources[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby-api[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby-docs[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_cid-checker-wallaby-docs-subresources[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby-archive[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby-dev-lotus-2346[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby_external[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ingress-kong_wallaby_private_0[0].module.generator.random_string.uid will be created
+ resource "random_string" "uid" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 53 to add, 6 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p k8s`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=glifio%252Ffilecoin-iac%252Fk8s%252Ffilecoin-mainnet-apn1-glif-eks)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p k8s`
</details>
Plan: 53 to add, 6 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
